#include "e3.h"

int motor_idx=-1;

/*********************************************************************************************************
函数名:     I2c_e3_find
入口参数:   list  设备表地址
出口参数:   无
返回值：         无
作者:       ljy
日期:       2025/8/11
调用描述:   检测E3设备是否存在，存在则显示E3设备地址个数与标号
**********************************************************************************************************/
void I2c_e3_find(i2c_probe_target *list)
{
	motor_idx = i2c_device_idx("E3_MOTOR");
	if((motor_idx<0)||(list[motor_idx].no<0)||(!list[motor_idx].detected_count)){
		perror("未探测到E3设备");
		exit(EXIT_FAILURE);
	}
	else{
		printf("检测到E3设备个数为:%d\n",list[motor_idx].detected_count);
		for(int i=0;i<list[motor_idx].detected_count;i++){
			printf("检测到的一个E3地址为0x%02x,标号为%d\n",list[motor_idx].detected_addrs[i],i);
		}
	}
}

/*********************************************************************************************************
函数名:	    I2c_e3_init
入口参数:   fd  i2c文件描述符		addr 窗帘的i2c地址
出口参数:   无 
返回值：         无
作者:       ljy
日期:       2025/8/2
调用描述:   初始化窗帘并移动到最左边
**********************************************************************************************************/
void I2c_e3_init(int fd, unsigned char addr)
{
	I2c_write_reg(fd, addr, 0x03, 0);
}

/*********************************************************************************************************
函数名:	    I2c_e3_init_all
入口参数:   fd  i2c文件描述符		list 设备表地址
出口参数:   无 
返回值：         无
作者:       ljy
日期:       2025/8/11
调用描述:   初始化窗帘并移动到最左边
**********************************************************************************************************/
void I2c_e3_init_all(int fd, i2c_probe_target *list)
{
	for(int i=0;i<list[motor_idx].detected_count;i++){
		I2c_e3_init(fd,list[motor_idx].detected_addrs[i]);
	}
}

/*********************************************************************************************************
函数名:     e3_set_position
入口参数:   fd  i2c文件描述符		addr 窗帘的i2c地址
	    re_pos 位置百分比(0-100)
出口参数:   无 
返回值：         无
作者:       ljy
日期:       2025/8/2
调用描述:   设置窗帘电机位置
**********************************************************************************************************/
void e3_set_position(int fd, unsigned char addr, char pos)
{
	I2c_write_reg(fd, addr, 0x03, pos);
}


/*********************************************************************************************************
函数名:     e3_get_status
入口参数:   fd  i2c文件描述符		addr 窗帘的i2c地址
出口参数:   无 
返回值:     E3 电机运动状态。0：停止中，1：运动中
作者:       ljy
日期:       2025/8/2
调用描述:   获取窗帘电机状态
**********************************************************************************************************/
unsigned char e3_get_status(int fd, unsigned char addr)
{
	uint8_t re_sta = 0;
	I2c_read_regs(fd, addr, 0x01, &re_sta, 1);
	return re_sta;
}

/*********************************************************************************************************
函数名:     e3_get_status
入口参数:   fd  i2c文件描述符		addr 窗帘的i2c地址
出口参数:   无 
返回值:     E3 电机运动状态,0~100。
作者:       ljy
日期:       2025/8/2
调用描述:   获取窗帘电机位置
**********************************************************************************************************/
unsigned char e3_get_position(int fd, unsigned char addr)
{
	uint8_t re_pos = 0;
	I2c_read_regs(fd, addr, 0x02, &re_pos, 1);
	return re_pos;
}
